/*
控制命令以\033[开头，以m结尾，而中间则是属性码，属性代码之间使用;分隔，如\033[1;34;42m。而属性代码的含义见下面的表格
---------通用格式控制---------
0---重置所有属性
1---高亮/加粗
2---暗淡
4---下划线
5---闪烁
7---反转
8---隐藏
---------前景色---------
30---黑色
31---红色
32---绿色
33---黄色
34---蓝色
35---品红
36---青色
---------背景色---------
40---黑色
41---红色
42---绿色
43---黄色
44---蓝色
45---品红
46---青色
*/

// 导入数据库 
#include <iostream>

// 使用std命名空间 
using namespace std;

// 主函数，程序入口 
int main()
{
	// 部分示例： 
	cout << "\033[1;30;40m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;40m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;40m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;40m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;40m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;40m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;40m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;30;41m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;41m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;41m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;41m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;41m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;41m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;41m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;30;42m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;42m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;42m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;42m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;42m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;42m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;30;43m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;43m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;43m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;43m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;43m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;43m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;43m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;30;44m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;44m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;44m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;44m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;44m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;44m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;44m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;30;45m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;45m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;45m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;45m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;45m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;45m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;45m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;30;46m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;31;46m我是一串字符哦\033[1;30;40m" << endl;
	cout << "\033[1;32;46m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;33;46m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;34;46m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;35;46m我是一串字符哦\033[1;30;40m" << endl; 
	cout << "\033[1;36;46m我是一串字符哦\033[1;30;40m" << endl;
	
	system("pause");
	
	return 0;
}

